cmsis-svd/cmsis-svd/data/NXP/MKE15Z4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TSI</name>
      <description>Touch sense input</description>
      <groupName>TSI</groupName>
      <prependToName>TSI_</prependToName>
      <baseAddress>0x40045000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TSI</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>GENCS</name>
          <description>TSI General Control and Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EOSDMEO</name>
              <description>End-of-Scan DMA Transfer Request Enable Only</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOSDMEO_0</name>
                  <description>Do not enable the End-of-Scan DMA transfer request only. Depending on ESOR state, either Out-of-Range or End-of-Scan can trigger a DMA transfer request and interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOSDMEO_1</name>
                  <description>Only the End-of-Scan event can trigger a DMA transfer request. The Out-of-Range event only and always triggers an interrupt if TSIIE is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOSF</name>
              <description>End of Scan Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOSF_0</name>
                  <description>Scan not complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOSF_1</name>
                  <description>Scan complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNIP</name>
              <description>Scan In Progress Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNIP_0</name>
                  <description>No scan in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCNIP_1</name>
                  <description>Scan in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STM</name>
              <description>Scan Trigger Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STM_0</name>
                  <description>Software trigger scan.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STM_1</name>
                  <description>Hardware trigger scan.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STPE</name>
              <description>TSI STOP Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STPE_0</name>
                  <description>TSI is disabled when MCU goes into low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STPE_1</name>
                  <description>Allows TSI to continue running in all low power modes.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSIIEN</name>
              <description>Touch Sensing Input Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSIIEN_0</name>
                  <description>TSI interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSIIEN_1</name>
                  <description>TSI interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSIEN</name>
              <description>Touch Sensing Input Module Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSIEN_0</name>
                  <description>TSI module disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSIEN_1</name>
                  <description>TSI module enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSOC_SEL</name>
              <description>CLKSOC_SEL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN_CTRL</name>
              <description>RUN_CTRL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSI_ANA_TEST</name>
              <description>TSI_ANA_TEST</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DVOLT</name>
              <description>DVOLT</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVOLT_0</name>
                  <description>Vm=0.3V; Vp=1.3V; dvolt=1.0V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_1</name>
                  <description>Vm=0.3V; Vp=1.6V; dvolt=1.3V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_2</name>
                  <description>Vm=0.3V; Vp=1.9V; dvolt=1.6V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_3</name>
                  <description>Vm=0.3V; Vp=2.3V; dvolt=2.0V.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESOR</name>
              <description>End-of-scan or Out-of-Range Interrupt Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESOR_0</name>
                  <description>Out-of-range interrupt is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESOR_1</name>
                  <description>End-of-scan interrupt is allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTRGF</name>
              <description>Out of Range Flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>TSI DATA Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSICNT</name>
              <description>TSI Conversion Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWTS</name>
              <description>Software Trigger Start</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWTS_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWTS_1</name>
                  <description>Start a scan to determine which channel is specified by TSI_DATA[TSICH].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Transfer Enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_0</name>
                  <description>Interrupt is selected when the interrupt enable bit is set and the corresponding TSI events assert.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_1</name>
                  <description>DMA transfer request is selected when the interrupt enable bit is set and the corresponding TSI events assert.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSICH</name>
              <description>TSICH</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSICH_0</name>
                  <description>For self-cap mode: Channel 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_1</name>
                  <description>For self-cap mode: Channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_2</name>
                  <description>For self-cap mode: Channel 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_3</name>
                  <description>For self-cap mode: Channel 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_4</name>
                  <description>For self-cap mode: Channel 4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_5</name>
                  <description>For self-cap mode: Channel 5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_6</name>
                  <description>For self-cap mode: Channel 6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_7</name>
                  <description>For self-cap mode: Channel 7.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_8</name>
                  <description>For self-cap mode: Channel 8.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_9</name>
                  <description>For self-cap mode: Channel 9.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_10</name>
                  <description>For self-cap mode: Channel 10.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_11</name>
                  <description>For self-cap mode: Channel 11.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_12</name>
                  <description>For self-cap mode: Channel 12.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_13</name>
                  <description>For self-cap mode: Channel 13.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_14</name>
                  <description>For self-cap mode: Channel 14.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_15</name>
                  <description>For self-cap mode: Channel 15.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_16</name>
                  <description>For self-cap mode: Channel 16.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_17</name>
                  <description>For self-cap mode: Channel 17.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_18</name>
                  <description>For self-cap mode: Channel 18.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_19</name>
                  <description>For self-cap mode: Channel 19.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_20</name>
                  <description>For self-cap mode: Channel 20.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_21</name>
                  <description>For self-cap mode: Channel 21.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_22</name>
                  <description>For self-cap mode: Channel 22.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_23</name>
                  <description>For self-cap mode: Channel 23.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICH_24</name>
                  <description>For self-cap mode: Channel 24.</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHD</name>
          <description>TSI Threshold Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THRESL</name>
              <description>TSI Wakeup Channel Low-threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESH</name>
              <description>TSI Wakeup Channel High-threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
